"""Exam4: RuleofThree

เนื่องจากเงินที่คุณได้รับจากงานที่คุณจ้างทำนั้นมีน้อยนิด ต้องประหยัด
แต่คุณก็ยังหิวอยู่ดี คุณจึงเข้าไปในร้านสะดวกซื้อในโลกคู่ขนาน
อาหารในโลกคู่ขนานนั้นไม่ได้แตกต่างจากโลกเฉยๆมาก
แต่ว่าเนื่องด้วยจากการเติบโตของประชากรนั้น ทำให้อาหาร 1 อย่าง มีการผลิตออกมาหลายขนาดมาก ยกตัวอย่างเช่น ขนมโอริโอ้ที่มีสามขนาด สามราคา

ราคา 5, 15, 30 บาท ที่มีขนาด 29.4, 68.5, 137 กรัมตามลำดับ
ถ้าหากคุณลองคำนวณดูดีๆแล้วจะพบว่า ขนาด 5 บาทนั้นคุ้มราคาที่สุด
 
ตัวอย่างถัดไป เลย์…. รสดั้งเดิม รสมันฝรั่งแท้........... รสเกลือ

ราคา 10, 20, 30, 57 บาท ขนาด 27, 52, 75, 170 กรัมตามลำดับ
กรณีนี้ ขนาด 57 บาทนั้นคุ้มราคาที่สุด (รองลงมาเป็นขนาด 10 บาท)
 
ปาปริก้า !!!


ราคา 10, 21 บาท ขนาด 32, 65 กรัมตามลำดับ
กรณีนี้จะพบว่าซองขนาด 10 บาทคุ้มราคากว่าขนาด 21 บาท
 
กรณีสุดท้าย... ไอศกรีม ช็อคโกแลตชิพ :D


ราคา 15, 39 บาท ขนาด 53, 160 กรัมตามลำดับ
กรณีนี้ขนาด 39 บาทจะคุ้มราคากว่าขนาด 15 บาท
 
ที่กล่าวมาคือตัวอย่างของอาหาร/ขนมจากโลกของคุณ
เนื่องจากในโลกคู่ขนานนี้คุณมีเงินเพียงน้อยนิด จึงต้องการที่จะเลือกซื้อขนมที่คุ้มราคาที่สุด เมื่อเทียบกับขนาดอื่นๆของขนมนั้นๆ
ถ้ามีสองขนาดขึ้นไปที่มีความคุ้มราคาเท่ากัน ให้เลือกขนาดที่ราคาต่ำกว่า
เนื่องจากคุณต้องการประหยัดเงิน แต่ก็ยังอยากกินขนมของโลกคู่ขนาน
 
by นายพิชาธร เอกอุ่น 
1 October 2016, 20:58
 Specification
 Input Specification	 Output Specification

1+2n บรรทัด

บรรทัดแรกเป็นจำนวนขนาดของขนมที่วางขาย

และอีกทีละสองบรรทัดต่อมา
บรรทัดที่หนึ่งเป็นราคาของขนมขนาดนั้นๆ
บรรทัดที่สองเป็นขนาดน้ำหนักสุทธิของขนมขนาดนั้นๆ

#sample case ที่ 1 คือตัวอย่าง Oreo ในรูปด้านบน
#sample case ที่ 2 คือตัวอย่าง เลย์ ในรูปด้านบน
#sample case ที่ 3 คือตัวอย่าง ปาปริก้า ในรูปด้านบน
#sample case ที่ 4 คือตัวอย่าง ไอศครีม ในรูปด้านบน 

บรรทัดเดียว เป็นราคาและขนาดของขนมที่คุ้มราคาที่สุดเป็นทศนิยมสองตำแหน่ง เว้นวรรคคั่นหนึ่งช่อง
  
 Sample Case
 Sample Input	 Sample Output
3
5
29.4
15
68.5
30
137
5.00 29.40
4
10
27
20
52
30
75
57
170
57.00 170.00
2
10
32
21
65
10.00 32.00
2
15
53
39
160
39.00 160.00"""
def ruleofthree(loop):
    """..."""
    value_price = 0
    value_size = 0
    most_value = 0
    for _ in range(loop):
        price = float(input())
        size = float(input())
        value = size/price
        if value >= most_value:
            if value == most_value:
                if price < value_price:
                    value_price = price
                    value_size = size
            else:
                value_price = price
                value_size = size
            most_value = value
    print("%.2f" %value_price, "%.2f" %value_size)
ruleofthree(int(input()))
