"""Exam1: SecondConverter

หลังจากคุณได้หลบหนีมาจากห้องของ AI ผ่านทางช่องทางใต้พื้น
ทุกๆอย่างดูลำบากลำบนจนระหว่างที่คุณกำลังมุดๆคลานๆอยู่นั้น ก็มีเสียงดังขึ้นมากจากในหัวของคุณ ดังมาก
เป็นช่วงเวลาสั้นๆ แต่ก็คุณก็ไม่รู้สึกเจ็บปวดอะไร จนกระทั่งคุณพบทางขึ้นสู่ผิวดิน

คุณพบว่า ตัวคุณอยู่บนกลางทุ่งร้างแห่งหนึ่ง ทุ่งเป็นเพียงต้นหญ้าเล็กๆ มองไปรอบๆแทบจะไม่มีตึกหรือบ้านในสายตาคุณเลย
และท้องฟ้า ดวงดาวนั้น แปลกไปจากที่คุณเคยเห็น คุณอยู่ที่ไหนกัน ?

เพื่อค้นพบคำตอบนี้ คุณจึงต้องลองไปหาถามคนแถวๆนี้ดู พบว่าที่นี่ไม่ใช่โลกปัจจุบันของคุณ
แต่เป็นโลกคู่ขนานกับโลกคุณ ที่มีแต่ความสงบสุข และมีความเจริญก้าวหน้าทางเทคโนโลยีไม่มากนัก ใกล้เคียงกับโลกของคุณ
แต่มีการกระจายความเจริญก้าวหน้าทางเทคโนโลยีที่ดีมาก เนื่องจากมีความสงบสุข ไม่มีความขัดแย้ง

ที่ที่คุณอยู่ตอนนี้นั้น เป็นเพียงชนบทแห่งหนึ่งของจังหวัดเท่านั้น แต่หากคุณต้องการเข้าเมือง ก็มีรถไฟฟ้าที่สามารถเดินทางจากที่นี่ได้
ไม่ใช่สิ คุณควรจะต้องการกลับโลกเดิมสิ แต่ก่อนอื่น คุณควรจะต้องตั้งเวลาให้ตรงกับโลกคู่ขนานก่อน

คุณพบว่าโลกคู่ขนานนั้นมีช่วงของเวลาไม่เหมือนกับโลกของคุณ แต่นับเวลาหน่วยพื้นฐานเป็นวินาทีเหมือนกัน
โดยที่หนึ่งนาทีของโลกคู่ขนานจะมีระยะเวลา s วินาที และ หนึ่งชั่วโมงจะมีเวลา m นาที และหนึ่งวันมี h ชั่วโมง
คุณจะต้องตั้งนาฬิกาของคุณให้รองรับระบบเวลานี้ โดยที่คุณจะต้องทดสอบว่า k วินาทีที่กำหนดให้ คือเวลาอะไร
โดยที่ถ้าเวลาเกิน 1 วัน จะต้องแสดงผลเวลาของวันถัดไป (หรือถัดๆๆๆไป) แทน โดยที่ไม่สนใจว่าเป็นวันที่เท่าไหร่
(กล่าวคือ ให้แสดงแค่ ชั่วโมง นาที และวินาที ของวันในโลกคู่ขนาน)
 
by นายพิชาธร เอกอุ่น 
1 October 2016, 20:58
 Specification
 Input Specification	 Output Specification

สี่บรรทัด
k { k >= 0}
s { s > 0 }
m { m > 0 }
h { h > 0 } 

หนึ่งบรรทัด เป็นเวลาในรูปแบบที่กำหนด โดยไม่ต้อง padding 0 ใดๆนำหน้า ให้ดู Sample Output เป็นตัวอย่าง
ชั่วโมง:นาที:วินาที 
 Sample Case
 Sample Input	 Sample Output
3661
60
60
24
1:1:1
7261
60
60
24
2:1:1
90061
60
60
24
1:1:1
900000
150
77
30
17:71:0
5999
75
80
20
0:79:74"""
def secondconverter(num, second, minute, hour):
    """...."""
    hou = num//(minute*second)
    minu = (num-(hou*minute*second))//second
    sec = num-(minu*second)-(hou*minute*second)
    #print(hou, minu, sec)
    return str(hou%hour)+":"+str(minu)+":"+str(sec)

print(secondconverter(int(input()), int(input()), int(input()), int(input())))
